In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    "name": ["A", "B", "C"],
    "Math" : [90, 86, 89],
    "Science" : [67, 78, 90]
}

df = pd.DataFrame(data)

df

  name  Math  Science
0    A    90       67
1    B    86       78
2    C    89       90

In [3]:
# Select column
df["Math"]

0    90
1    86
2    89
Name: Math, dtype: int64

In [4]:
# select multiple columns
df[["Math", "Science"]]

   Math  Science
0    90       67
1    86       78
2    89       90

In [5]:
df.columns

Index(['name', 'Math', 'Science'], dtype='object')

In [6]:
data = {
    "name": ["A", "B", "C"],
    "Age" : [20,30,40],
    "City" : ["Rajkot", "Surat", "Jaipur"]
}

df = pd.DataFrame(data)
print(df)

  name  Age    City
0    A   20  Rajkot
1    B   30   Surat
2    C   40  Jaipur

In [7]:
# select specific row
df.loc[0]
# df.loc[0:1]

name         A
Age         20
City    Rajkot
Name: 0, dtype: object

In [8]:
df.iloc[0]
df.iloc[0:2]

  name  Age    City
0    A   20  Rajkot
1    B   30   Surat

In [9]:
data = {
    "name": ["A", "B", "C", "D", "E"],
    "marks": [97, 68, 89, 78, 90]
}

df = pd.DataFrame(data)

df

  name  marks
0    A     97
1    B     68
2    C     89
3    D     78
4    E     90

In [10]:
# print(df[df["marks"] > 80])
# print(df[df["name"] == "A"])
# df["grade"] = ["AA", "DD", "BB", "CC", "AA"]

df["Passed"] = df["marks"] > 80

df

  name  marks  Passed
0    A     97    True
1    B     68   False
2    C     89    True
3    D     78   False
4    E     90    True

In [11]:
df.sort_values(by="marks", ascending=False)

  name  marks  Passed
0    A     97    True
4    E     90    True
2    C     89    True
3    D     78   False
1    B     68   False

In [12]:
# df = df.set_index("grade")
df = df.reset_index()
df

   index name  marks  Passed
0      0    A     97    True
1      1    B     68   False
2      2    C     89    True
3      3    D     78   False
4      4    E     90    True

In [13]:
data = {
    "name": ["Bob", "Aman", "Jay", "Raj", "Nayan", "Neha", "Bob"],
    "marks" : [89, 78, None, 92, 75, np.nan, 89],
    "attendance":  [95, 88, 56, None, 78, np.nan, 95]
}

df = pd.DataFrame(data)
df

    name  marks  attendance
0    Bob   89.0        95.0
1   Aman   78.0        88.0
2    Jay    NaN        56.0
3    Raj   92.0         NaN
4  Nayan   75.0        78.0
5   Neha    NaN         NaN
6    Bob   89.0        95.0

In [14]:
df.isnull()
df.isnull().sum()
df.notnull()
df.dropna()

    name  marks  attendance
0    Bob   89.0        95.0
1   Aman   78.0        88.0
4  Nayan   75.0        78.0
6    Bob   89.0        95.0

In [15]:
df["marks"] = df["marks"].fillna(df["marks"].mean())
df["attendance"] = df["attendance"].fillna(100)
df

    name  marks  attendance
0    Bob   89.0        95.0
1   Aman   78.0        88.0
2    Jay   84.6        56.0
3    Raj   92.0       100.0
4  Nayan   75.0        78.0
5   Neha   84.6       100.0
6    Bob   89.0        95.0

In [16]:
df.drop_duplicates()

    name  marks  attendance
0    Bob   89.0        95.0
1   Aman   78.0        88.0
2    Jay   84.6        56.0
3    Raj   92.0       100.0
4  Nayan   75.0        78.0
5   Neha   84.6       100.0

In [18]:
df["name"].value_counts()

name
Bob      2
Aman     1
Jay      1
Raj      1
Nayan    1
Neha     1
Name: count, dtype: int64